Extensions/УВМ/Catalogs/ШтатноеРасписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтатноеРасписание</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ГрафикРаботы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПродолжительностьСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/УВМ/InformationRegisters/МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МестоПозицииШтатногоРасписанияВСтруктуреПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УВМ_ДолжностьУпр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_ДолжностиУпр</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/УВМ/Catalogs/ШтатноеРасписание/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+dar 20221102 (24881)
	ДопСвойства = Новый Структура;
	ДопСвойства.Вставить("Высота", 2);
	ДопСвойства.Вставить("АвтоМаксимальнаяШирина", Ложь);
	ДопСвойства.Вставить("МаксимальнаяШирина", 48);
	ДопСвойства.Вставить("РастягиватьПоВертикали", Ложь);
	
	УВМ_График = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ГрафикРаботы", Элементы.ГруппаУсловияПриемаКраткоеОписание, "Объект.УВМ_ГрафикРаботы", , Элементы.КраткоеОписание, , ДопСвойства);
	УВМ_Продолжительность = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ПродолжительностьСмены", Элементы.ГруппаУсловияПриемаКраткоеОписание, "Объект.УВМ_ПродолжительностьСмены", , Элементы.КраткоеОписание, , ДопСвойства);
	//-dar 20221102 (24881) 
	
	// + СБит 2023-12-25 160495 
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтаФорма, "ЗарегистрироватьКВыгрузке", Новый ОписаниеТипов("Булево")); 
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтаФорма, "УВМ_ДолжностьУпр", Новый ОписаниеТипов("СправочникСсылка.УВМ_ДолжностиУпр")); 
	НовыйЭлемент = УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_ДолжностьУпр", Элементы.ЛеваяКолонка, "УВМ_ДолжностьУпр",,,"Должность управленческая");
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "УВМ_ДолжностьУпрПриИзменении");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		// + СБит 2026-08-06 #УВМ
		Отбор = Новый Структура("Позиция", Объект.Ссылка);
		Должности = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(ТекущаяДатаСеанса(), Отбор);
		// - СБит 2026-08-06 #УВМ
		Если Должности.Количество()>0 Тогда
			ЭтаФорма["УВМ_ДолжностьУпр"] = Должности[0].УВМ_ДолжностьУпр;
		КонецЕсли;
	КонецЕсли;
    // - СБит 2023-12-25
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//dar++ 20221212
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда 
		// + СБит 2026-07-13 #УВМ
		//Если НЕ ЗначениеЗаполнено(ЭтаФорма.МестоВСтруктуреПредприятия.Подразделение) Тогда
		//	ОбщегоНазначения.СообщитьПользователю("Не заполнено место в стр-ре предприятия!", , , , Отказ);
		//	Отказ = Истина;
		//КонецЕсли;
		// - СБит 2026-07-13 #УВМ
	КонецЕсли;
	//--dar 20221212
	
	// + СБит 2024-03-12
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// 1
		ПредыдущиеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Должность,Подразделение");
		
		// 2 
		// + СБит 2026-08-06 #УВМ
		ПредыдущиеЗначения.Вставить("УВМ_ДолжностьУпр", Справочники.УВМ_ДолжностиУпр.ПустаяСсылка());
		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(ТекущаяДатаСеанса(), Новый Структура("Позиция",Объект.Ссылка));
		// - СБит 2026-08-06 #УВМ
		Если НаборЗаписей.Количество()>0 Тогда
			ПредыдущиеЗначения.УВМ_ДолжностьУпр = НаборЗаписей[0].УВМ_ДолжностьУпр;
		КонецЕсли;
		
		// 3
		Если ПредыдущиеЗначения.Должность <> Объект.Должность ИЛИ ПредыдущиеЗначения.Подразделение <> Объект.Подразделение ИЛИ ПредыдущиеЗначения.УВМ_ДолжностьУпр <> ЭтаФорма["УВМ_ДолжностьУпр"] Тогда  
			ЭтаФорма["ЗарегистрироватьКВыгрузке"] = Истина;
		КонецЕсли;
	КонецЕсли;
	// - СБит 2024-03-12
	
КонецПроцедуры

&НаСервере
Процедура УВМ_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаСервере
Процедура УВМ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	// + СБит 2023-12-25 160495 
	Привилегии = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	// + СБит 2026-08-06 #УВМ
	Отбор = Новый Структура("Позиция", Объект.Ссылка);
	Должности = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(ТекущаяДатаСеанса(), Отбор);
	Если Должности.Количество() = 0 Или ЭтаФорма["УВМ_ДолжностьУпр"] <> Должности[0].УВМ_ДолжностьУпр Тогда
		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса());
		НаборЗаписей.Прочитать();
        Если НаборЗаписей.Количество() =0 Тогда
			Запись = НаборЗаписей.Добавить(); 
		Иначе	
			Запись = НаборЗаписей[0];
		КонецЕсли;	
		Запись.Период = ТекущаяДатаСеанса(); 
		Запись.Позиция = Объект.Ссылка;
		Запись.УВМ_ДолжностьУпр = ЭтаФорма["УВМ_ДолжностьУпр"];
		НаборЗаписей.Записать(Истина); 
	КонецЕсли;
	// - СБит 2026-08-06 #УВМ
	
	// + СБит 2024-03-12
	Если ЭтаФорма["ЗарегистрироватьКВыгрузке"] = Истина Тогда
		ОбменДаннымиПереопределяемый.ОбновитьИсториюСотрудниковПоШтатке(Объект.Ссылка);
	КонецЕсли;	
	// - СБит 2024-03-12
	УстановитьПривилегированныйРежим(Привилегии);
		
    // - СБит 2023-12-25 
КонецПроцедуры

&НаКлиенте
Процедура УВМ_ДолжностьУпрПриИзменении(Элемент)
	
	// + СБит 2023-12-25 160495 
	Модифицированность = Истина;
    // - СБит 2023-12-25
	
КонецПроцедуры
